[
  {
    "title": "Year of Yes by Shonda Rhimes",
    "content": "<p>shonda rhime's autobiography was fun and felt like talking to a best friend. if you are looking to make some changes this book is a great way to surround yourself with encouraging thoughts. there's not a lot of concrete step by step follow all these rules sections which I thought was great. instead of prescribing a life style, rhime's is sharing a story about how she made her own rules for change and encourages others to do the same. </p>\n<p>there was section about weight which had some of the pitfalls of all weight loss self help: fat as a representation of toxic elements in life and there being a better, skinner version underneath it all. Even though there was no crazy diet suggestions and shonda tried to differentiate between fatness being bad for everyone and fatness being bad for her, she didn't quite get over the hurdle of negative body talk. </p>\n<p>still, this book was a mood booster and perfect if you hate self help books but are looking for a little motivation to shake things up. if you like greys anatomy you'd probably appreciate the reference and i've never seen it and started tearing up when she described sandrah oh last scene!</p>",
    "date": "May 22, 2024",
    "dateSort": "2024-05-22"
  },
  {
    "title": "Dice for random study breaks!",
    "content": "<p>This was inspired by the pomodoro method and my inability to make decisions. When you are taking a quick 5 minute study break, use this digital die to decide what to do! The code for this project was adpated from <a href=\"https://icodemag.com/3d-rolling-dice-css-javascript/\">this cool tutorial</a>.</p>\n<p>(i cannot figure out how to center the die. it is killing me.)</p>\n<iframe src=\"dice!/diceIndex.html\" frameborder=\"0\"></iframe>\n\n<style>\n        /* Define the size of the embedded window */\n        iframe {\n            width: 500px; /* Adjust width as needed */\n            height: 300px; /* Adjust height as needed */\n            border: 1px solid #000; /* Add border for visual clarity */\n        }\n</style>",
    "date": "April 18, 2024",
    "dateSort": "2024-04-18"
  },
  {
    "title": "Hello!",
    "content": "<p>why hellooo! this is my blog where I am practicing writing and coding! I'm still learning so it's not perfect but I hope I get better at expressing myself, writing, and programming. Wish me luck.  </p>\n<p>✸ Mary ✸</p>",
    "date": "April 15, 2024",
    "dateSort": "2024-04-15"
  }
]